{
  "backend/main.mo": "Motoko canister managing user profiles, orders, leads, products, file references, and Stripe/config state with authorization checks.",
  "feature_evidence.json": "Feature evidence report mapping product features to related source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Plain-text index of frontend files with brief descriptions of their purpose and behavior.",
  "frontend/index.css": "Tailwind CSS entry defining global design tokens, light/dark theme variables, and base styles.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React app root.",
  "frontend/src/App.tsx": "Main React app configuring routes, theme provider, and global layout with TanStack Router.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for first-time users to submit name, email, and phone and save their profile.",
  "frontend/src/components/auth/RequireAuth.tsx": "Auth gate that requires Internet Identity login before rendering protected content.",
  "frontend/src/components/chatbot/chatbotScript.ts": "Defines chatbot state machine, input processor, budget parsing, and package suggestion logic.",
  "frontend/src/components/chatbot/ChatbotWidget.tsx": "Interactive floating chatbot widget managing conversation state, user messages, and lead submission.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders site footer with navigation links, branding, and a Caffeine.ai attribution link.",
  "frontend/src/components/layout/SiteHeader.tsx": "Navigation header with authentication handling, responsive mobile menu, and identity management.",
  "frontend/src/components/layout/SiteLayout.tsx": "Main layout combining header, footer, routed content, and the chatbot widget.",
  "frontend/src/components/payments/ManualPaymentInfo.tsx": "Displays manual payment number with copy-to-clipboard and supported payment methods.",
  "frontend/src/components/trial/FreeTrialClaimCard.tsx": "Card for claiming or showing status of a free trial, triggering an upgrade modal when claimed.",
  "frontend/src/components/trial/UpgradePromptModal.tsx": "Modal prompting users to upgrade after claiming the free trial, with navigation to pricing.",
  "frontend/src/hooks/useActor.ts": "Hook creating authenticated or anonymous backend actors and refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity, handling auth client creation, identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/usePageMeta.ts": "Updates document title and description meta tag when the page loads or dependencies change.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in React Query hooks for fetching and mutating user profiles, dashboard data, leads, products, orders, and Stripe config.",
  "frontend/src/hooks/useStripeCheckout.ts": "Creates Stripe checkout sessions and retrieves session status using backend actor mutations.",
  "frontend/src/index.css": "Defines global Tailwind styles, CSS variables, typography, and base theme settings.",
  "frontend/src/main.tsx": "Initializes the React app, setting up QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/DashboardPage.tsx": "Displays user dashboard with profile info, orders, leads, free trial status, and triggers profile setup when needed.",
  "frontend/src/pages/funnel/FunnelLandingPage.tsx": "Landing page promoting fast website delivery with a call to claim a free demo.",
  "frontend/src/pages/funnel/LeadCapturePage.tsx": "Form page collecting lead details and submitting them before redirecting to a thank-you page.",
  "frontend/src/pages/funnel/ThankYouPage.tsx": "Confirms successful lead submission and offers navigation to pricing or home.",
  "frontend/src/pages/HomePage.tsx": "Renders the marketing homepage with hero section, navigation actions, and feature highlights.",
  "frontend/src/pages/legal/PrivacyPolicyPage.tsx": "Renders the Privacy Policy page with static policy sections and sets page metadata.",
  "frontend/src/pages/legal/RefundPolicyPage.tsx": "Displays the refund policy with highlighted no‑refund notice and structured sections.",
  "frontend/src/pages/legal/TermsPage.tsx": "Shows the Terms & Conditions page outlining services, payment, delivery, and rights.",
  "frontend/src/pages/OrderPage.tsx": "Provides an authenticated order submission form supporting package selection, notes, and payment method handling.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment failure message with retry and home navigation options.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows a payment success confirmation with links to the dashboard or home.",
  "frontend/src/pages/PortfolioPage.tsx": "Renders a filterable portfolio of design items with options to order similar designs.",
  "frontend/src/pages/PricingPage.tsx": "Provides pricing plans and handles Stripe checkout or trial claiming depending on user state.",
  "frontend/src/pages/ServicesPage.tsx": "Lists available design services with features, prices, and order actions.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, and clear URL and session parameters for navigation state.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, plugins, colors, fonts, animations, and content paths.",
  "project_state.json": "Stores project metadata, requirements, images, and known issues for the PixelNova build."
}